{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<bos>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "^": 65,
      "_": 66,
      "`": 67,
      "a": 68,
      "b": 69,
      "c": 70,
      "d": 71,
      "e": 72,
      "f": 73,
      "g": 74,
      "h": 75,
      "i": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "n": 81,
      "o": 82,
      "p": 83,
      "q": 84,
      "r": 85,
      "s": 86,
      "t": 87,
      "u": 88,
      "v": 89,
      "w": 90,
      "x": 91,
      "y": 92,
      "z": 93,
      "{": 94,
      "|": 95,
      "}": 96,
      "~": 97,
      "¡": 98,
      "¢": 99,
      "£": 100,
      "¤": 101,
      "¥": 102,
      "¦": 103,
      "§": 104,
      "¨": 105,
      "©": 106,
      "ª": 107,
      "«": 108,
      "¬": 109,
      "®": 110,
      "¯": 111,
      "°": 112,
      "±": 113,
      "²": 114,
      "³": 115,
      "´": 116,
      "µ": 117,
      "¶": 118,
      "·": 119,
      "¸": 120,
      "¹": 121,
      "º": 122,
      "»": 123,
      "¼": 124,
      "½": 125,
      "¾": 126,
      "¿": 127,
      "À": 128,
      "Á": 129,
      "Â": 130,
      "Ã": 131,
      "Ä": 132,
      "Å": 133,
      "Æ": 134,
      "Ç": 135,
      "È": 136,
      "É": 137,
      "Ê": 138,
      "Ë": 139,
      "Ì": 140,
      "Í": 141,
      "Î": 142,
      "Ï": 143,
      "Ð": 144,
      "Ñ": 145,
      "Ò": 146,
      "Ó": 147,
      "Ô": 148,
      "Õ": 149,
      "Ö": 150,
      "×": 151,
      "Ø": 152,
      "Ù": 153,
      "Ú": 154,
      "Û": 155,
      "Ü": 156,
      "Ý": 157,
      "Þ": 158,
      "ß": 159,
      "à": 160,
      "á": 161,
      "â": 162,
      "ã": 163,
      "ä": 164,
      "å": 165,
      "æ": 166,
      "ç": 167,
      "è": 168,
      "é": 169,
      "ê": 170,
      "ë": 171,
      "ì": 172,
      "í": 173,
      "î": 174,
      "ï": 175,
      "ð": 176,
      "ñ": 177,
      "ò": 178,
      "ó": 179,
      "ô": 180,
      "õ": 181,
      "ö": 182,
      "÷": 183,
      "ø": 184,
      "ù": 185,
      "ú": 186,
      "û": 187,
      "ü": 188,
      "ý": 189,
      "þ": 190,
      "ÿ": 191,
      "Ā": 192,
      "ā": 193,
      "Ă": 194,
      "ă": 195,
      "Ą": 196,
      "ą": 197,
      "Ć": 198,
      "ć": 199,
      "Ĉ": 200,
      "ĉ": 201,
      "Ċ": 202,
      "ċ": 203,
      "Č": 204,
      "č": 205,
      "Ď": 206,
      "ď": 207,
      "Đ": 208,
      "đ": 209,
      "Ē": 210,
      "ē": 211,
      "Ĕ": 212,
      "ĕ": 213,
      "Ė": 214,
      "ė": 215,
      "Ę": 216,
      "ę": 217,
      "Ě": 218,
      "ě": 219,
      "Ĝ": 220,
      "ĝ": 221,
      "Ğ": 222,
      "ğ": 223,
      "Ġ": 224,
      "ġ": 225,
      "Ģ": 226,
      "ģ": 227,
      "Ĥ": 228,
      "ĥ": 229,
      "Ħ": 230,
      "ħ": 231,
      "Ĩ": 232,
      "ĩ": 233,
      "Ī": 234,
      "ī": 235,
      "Ĭ": 236,
      "ĭ": 237,
      "Į": 238,
      "į": 239,
      "İ": 240,
      "ı": 241,
      "Ĳ": 242,
      "ĳ": 243,
      "Ĵ": 244,
      "ĵ": 245,
      "Ķ": 246,
      "ķ": 247,
      "ĸ": 248,
      "Ĺ": 249,
      "ĺ": 250,
      "Ļ": 251,
      "ļ": 252,
      "Ľ": 253,
      "ľ": 254,
      "Ŀ": 255,
      "ŀ": 256,
      "Ł": 257,
      "ł": 258,
      "Ń": 259,
      "Ġt": 260,
      "he": 261,
      "Ġa": 262,
      "Ġi": 263,
      "Ġthe": 264,
      "on": 265,
      "re": 266,
      "at": 267,
      "in": 268,
      "Ġs": 269,
      "er": 270,
      "Ġc": 271,
      "Ġis": 272,
      "Ġo": 273,
      "le": 274,
      "ti": 275,
      "en": 276,
      "al": 277,
      "or": 278,
      "Ġp": 279,
      "Ġf": 280,
      "Ġw": 281,
      "es": 282,
      "an": 283,
      "Ġb": 284,
      "Ġan": 285,
      "ed": 286,
      "Ġof": 287,
      "ar": 288,
      "Ġd": 289,
      "ing": 290,
      "ro": 291,
      "is": 292,
      "it": 293,
      "Ġm": 294,
      "Ġth": 295,
      "Ġin": 296,
      "Ġto": 297,
      "ou": 298,
      "ic": 299,
      "tion": 300,
      "Ġand": 301,
      "ĠT": 302,
      "st": 303,
      "Ġn": 304,
      "ra": 305,
      "Ġ$": 306,
      "Ġe": 307,
      "ve": 308,
      "ion": 309,
      "om": 310,
      "et": 311,
      "ĠI": 312,
      "Ġh": 313,
      "ow": 314,
      "ol": 315,
      "as": 316,
      "ot": 317,
      "ct": 318,
      "Ġl": 319,
      "ig": 320,
      "Ġre": 321,
      "ation": 322,
      "Ġ\\": 323,
      "Ġcon": 324,
      "Ġthat": 325,
      "Ġthen": 326,
      "ent": 327,
      "Ġ1": 328,
      "ĠThe": 329,
      "un": 330,
      "Ġg": 331,
      "Ġ(": 332,
      "um": 333,
      "ly": 334,
      "ce": 335,
      "se": 336,
      "ut": 337,
      "âĢ": 338,
      "Ġ2": 339,
      "ĠA": 340,
      "Ġfor": 341,
      "ore": 342,
      "ĠS": 343,
      "##": 344,
      "Ġbe": 345,
      "Ġv": 346,
      "Ġon": 347,
      "qu": 348,
      "ll": 349,
      "Ġpro": 350,
      "im": 351,
      "de": 352,
      "Ġy": 353,
      "ul": 354,
      "ch": 355,
      "Ġif": 356,
      "Ġst": 357,
      "am": 358,
      "ss": 359,
      "ĠC": 360,
      "ble": 361,
      "ue": 362,
      "Ġit": 363,
      "em": 364,
      "Ġ=": 365,
      "ith": 366,
      "Ġtr": 367,
      "ĠP": 368,
      "ver": 369,
      "te": 370,
      "fore": 371,
      "igh": 372,
      "Ġu": 373,
      "Ġyou": 374,
      "ction": 375,
      "ĠThere": 376,
      "Ġex": 377,
      "ple": 378,
      "Âł": 379,
      "ag": 380,
      "ĠW": 381,
      "ĠM": 382,
      "Ġare": 383,
      "ĠTherefore": 384,
      "id": 385,
      "Ġcom": 386,
      "ur": 387,
      "ĠR": 388,
      "$$": 389,
      "os": 390,
      "ĠB": 391,
      "ĠF": 392,
      "ure": 393,
      "Ġwith": 394,
      "ay": 395,
      "if": 396,
      "ath": 397,
      "pp": 398,
      "ir": 399,
      "Ġwe": 400,
      "ate": 401,
      "Ġthis": 402,
      "Ġk": 403,
      "ight": 404,
      "ri": 405,
      "00": 406,
      "Ġde": 407,
      "ĠD": 408,
      "il": 409,
      "Ġr": 410,
      "Ġat": 411,
      "Ġwh": 412,
      "Ġas": 413,
      "ine": 414,
      "ist": 415,
      "ad": 416,
      "int": 417,
      "Ġ-": 418,
      "Ġtrue": 419,
      "Ġcan": 420,
      "per": 421,
      "ld": 422,
      "rac": 423,
      "ĠH": 424,
      "ĠE": 425,
      "}{": 426,
      "pl": 427,
      "able": 428,
      "Ġor": 429,
      "ter": 430,
      "..": 431,
      "iv": 432,
      "Ġby": 433,
      "pe": 434,
      "ĠĠ": 435,
      "ck": 436,
      "rom": 437,
      "ave": 438,
      "âĢ¢": 439,
      "tic": 440,
      "Ġ3": 441,
      "Ġse": 442,
      "Ġle": 443,
      "Ġen": 444,
      "her": 445,
      "ity": 446,
      "now": 447,
      "Ġdo": 448,
      "Ġ$$": 449,
      "ers": 450,
      "od": 451,
      "Ġal": 452,
      "Ġnot": 453,
      "and": 454,
      "frac": 455,
      "ĠL": 456,
      "ĠIf": 457,
      "Ġknow": 458,
      "ces": 459,
      "Ġsu": 460,
      "ĠG": 461,
      "ge": 462,
      "Ġ0": 463,
      "th": 464,
      "_{": 465,
      "ĠN": 466,
      "ode": 467,
      "Ġval": 468,
      "Ġhave": 469,
      "ations": 470,
      "^{": 471,
      "ren": 472,
      "ta": 473,
      "tive": 474,
      "unction": 475,
      "Ġ+": 476,
      "ect": 477,
      "Ġ$\\": 478,
      "us": 479,
      "Ġus": 480,
      "}$": 481,
      "ant": 482,
      "01": 483,
      "Ġne": 484,
      "ari": 485,
      "ke": 486,
      "Ġfrom": 487,
      "Ġlo": 488,
      "Ġfunction": 489,
      "ment": 490,
      "und": 491,
      "ph": 492,
      "res": 493,
      "ition": 494,
      "pt": 495,
      "Ġpo": 496,
      "ould": 497,
      "Ġass": 498,
      "old": 499,
      "lo": 500,
      "ich": 501,
      "Ġab": 502,
      "ft": 503,
      "ule": 504,
      "ĠWe": 505,
      "ber": 506,
      "Ġsh": 507,
      "Ġx": 508,
      "Ġqu": 509,
      "ĠTh": 510,
      "ome": 511,
      "low": 512,
      "Ġcont": 513,
      "ill": 514,
      "here": 515,
      "ĠO": 516,
      "ally": 517,
      "ie": 518,
      "ption": 519,
      "age": 520,
      "Ġme": 521,
      "math": 522,
      "orm": 523,
      "Ġma": 524,
      "ĠâĢ": 525,
      "ong": 526,
      "Ġ4": 527,
      "Ġnum": 528,
      "Ġcl": 529,
      "xt": 530,
      "ĠIn": 531,
      "Ġch": 532,
      "fe": 533,
      "fin": 534,
      "ab": 535,
      "rad": 536,
      "so": 537,
      "Ġcomple": 538,
      "ĠU": 539,
      "{\\": 540,
      "ind": 541,
      "Ġassum": 542,
      "--": 543,
      "end": 544,
      "Ġequ": 545,
      "pa": 546,
      "oun": 547,
      "ign": 548,
      "iz": 549,
      "Ġsy": 550,
      "ust": 551,
      "The": 552,
      "Ġset": 553,
      "oth": 554,
      "Ġall": 555,
      "ive": 556,
      "ies": 557,
      "Ġpre": 558,
      "Ġwhich": 559,
      "ite": 560,
      "Ġpar": 561,
      "ip": 562,
      "ution": 563,
      "ĠV": 564,
      "Ġim": 565,
      "Ġac": 566,
      "ang": 567,
      "ass": 568,
      "ated": 569,
      "ĠJ": 570,
      "feren": 571,
      "du": 572,
      "est": 573,
      "Ġvari": 574,
      "###": 575,
      "}\\": 576,
      "'s": 577,
      "ous": 578,
      "ult": 579,
      "to": 580,
      "ied": 581,
      "el": 582,
      "our": 583,
      "cess": 584,
      "Ġbut": 585,
      "Ġwill": 586,
      "Ġ\"": 587,
      "Ġone": 588,
      "stem": 589,
      "Ġpath": 590,
      "ase": 591,
      "Ġ5": 592,
      "Ġres": 593,
      "wo": 594,
      "ĠY": 595,
      "hen": 596,
      "Ġconst": 597,
      "right": 598,
      "ans": 599,
      "Ġun": 600,
      "put": 601,
      "ork": 602,
      "estion": 603,
      "tim": 604,
      "ile": 605,
      ").": 606,
      "ort": 607,
      "ci": 608,
      "ame": 609,
      "Ġcomplete": 610,
      "Ġstr": 611,
      "ard": 612,
      "ĠThis": 613,
      "ical": 614,
      "cl": 615,
      "Ġ201": 616,
      "Ġeng": 617,
      "Ġso": 618,
      "ample": 619,
      "Ġapp": 620,
      "act": 621,
      "Ġvalue": 622,
      "ther": 623,
      "ach": 624,
      "ps": 625,
      "Ġ{": 626,
      "Ġgro": 627,
      "Ġtwo": 628,
      "Ġhe": 629,
      "out": 630,
      "ma": 631,
      "all": 632,
      "ens": 633,
      "Ġsystem": 634,
      "ove": 635,
      "ff": 636,
      "Ġrel": 637,
      "ub": 638,
      "Ġsim": 639,
      "og": 640,
      "Ġsol": 641,
      "irc": 642,
      "ide": 643,
      ")$": 644,
      "ary": 645,
      "âĢĻ": 646,
      "ĠQ": 647,
      "If": 648,
      "blem": 649,
      "dition": 650,
      "ost": 651,
      "iction": 652,
      "ollow": 653,
      "Ġmat": 654,
      "Ġform": 655,
      "Ġ'": 656,
      "Ġassumption": 657,
      "Ġdefin": 658,
      "erm": 659,
      "ature": 660,
      "Ġthere": 661,
      "iven": 662,
      "ime": 663,
      "Ġhas": 664,
      "Ġsome": 665,
      "Ġcontrad": 666,
      "red": 667,
      "ance": 668,
      "atis": 669,
      "Ġj": 670,
      "Ġuse": 671,
      "),": 672,
      "ents": 673,
      "...": 674,
      "left": 675,
      "Ġnon": 676,
      "Ġboth": 677,
      "Ġdif": 678,
      "ence": 679,
      "ud": 680,
      "Ġfollow": 681,
      "ning": 682,
      "ok": 683,
      "Ġwas": 684,
      "li": 685,
      "Ġnumber": 686,
      "Ġvariable": 687,
      "ery": 688,
      "Ġyour": 689,
      "Ġ&": 690,
      "of": 691,
      "form": 692,
      "con": 693,
      "Ġpl": 694,
      "Ġalso": 695,
      "ric": 696,
      "10": 697,
      "Ġpos": 698,
      "ata": 699,
      "Ġop": 700,
      "}}": 701,
      "tial": 702,
      "Ġad": 703,
      "ord": 704,
      "ĠâĢĵ": 705,
      "Ġ[": 706,
      "ose": 707,
      "ĠX": 708,
      "ys": 709,
      "ca": 710,
      "ĠĠĠĠ": 711,
      "itive": 712,
      "Ġany": 713,
      "Ġinte": 714,
      "ack": 715,
      "ator": 716,
      "Ġout": 717,
      "Ġar": 718,
      "Ġsign": 719,
      "Ġli": 720,
      "ics": 721,
      "Ġcontradiction": 722,
      "Ġpoint": 723,
      "'t": 724,
      "Ġproblem": 725,
      "ĠRule": 726,
      "ree": 727,
      "Ġ6": 728,
      "ener": 729,
      "text": 730,
      "irst": 731,
      "Ġcirc": 732,
      "ĠAn": 733,
      "Ġhow": 734,
      "__": 735,
      "gh": 736,
      "Ġper": 737,
      "hem": 738,
      "rib": 739,
      "we": 740,
      "ear": 741,
      "Ġob": 742,
      "Ġprocess": 743,
      "osed": 744,
      "Ġco": 745,
      "ry": 746,
      "ĠZ": 747,
      "ory": 748,
      "ast": 749,
      "art": 750,
      "Ġdifferen": 751,
      "ining": 752,
      "ound": 753,
      "eth": 754,
      "Ġexist": 755,
      "Ġusing": 756,
      "ne": 757,
      "Ġquestion": 758,
      "ial": 759,
      "Ġconver": 760,
      "Ġwould": 761,
      "Ġhold": 762,
      "Ġro": 763,
      "av": 764,
      "Ġcondition": 765,
      "atisf": 766,
      "ĠK": 767,
      "hat": 768,
      "com": 769,
      "up": 770,
      "In": 771,
      "Ġabove": 772,
      "Ġsatisf": 773,
      "ac": 774,
      "Ġdis": 775,
      "Ġspe": 776,
      "Ġrun": 777,
      "$.": 778,
      "Ġget": 779,
      "Ġsub": 780,
      "Ġpositive": 781,
      "ram": 782,
      "Ġcal": 783,
      "Ġ10": 784,
      "Ġother": 785,
      "odel": 786,
      "Ġmore": 787,
      "ain": 788,
      "ess": 789,
      "ject": 790,
      "Ġwhat": 791,
      "ative": 792,
      "ak": 793,
      "are": 794,
      "Ġwork": 795,
      "Ġhigh": 796,
      "Ġele": 797,
      "12": 798,
      "Ġbet": 799,
      "cul": 800,
      "raint": 801,
      "Ġtem": 802,
      "one": 803,
      "Ġam": 804,
      "Ġdi": 805,
      "ress": 806,
      "Ġ.": 807,
      "Ġdefined": 808,
      "Ġconstraint": 809,
      "pon": 810,
      "Ġlike": 811,
      "Ġopen": 812,
      "ges": 813,
      "Ġonly": 814,
      "Ġno": 815,
      "ep": 816,
      "Ġtime": 817,
      "eg": 818,
      "Ġproof": 819,
      "the": 820,
      "Ġinter": 821,
      "ink": 822,
      "Ġra": 823,
      "Ġmy": 824,
      "Ġline": 825,
      "Ġ$$\\": 826,
      "perature": 827,
      "Th": 828,
      "ĠBut": 829,
      "use": 830,
      "nect": 831,
      "ates": 832,
      "Ġfirst": 833,
      "Ġwhere": 834,
      "Ġlight": 835,
      "Ġdist": 836,
      "mathb": 837,
      "Ġsatisfied": 838,
      "Ġwr": 839,
      "20": 840,
      "Ġtemperature": 841,
      "(\\": 842,
      "Ġdata": 843,
      "uit": 844,
      "Ġ7": 845,
      "Ġgener": 846,
      "sw": 847,
      "ular": 848,
      "Ġabout": 849,
      "cal": 850,
      "Ġsignal": 851,
      "Ġgo": 852,
      "Ġinteg": 853,
      "Ġwhen": 854,
      "Ġeach": 855,
      "Ġte": 856,
      "empt": 857,
      "Ġthan": 858,
      "Ġpress": 859,
      "les": 860,
      "ors": 861,
      "Ġ:": 862,
      "hip": 863,
      "rect": 864,
      "tain": 865,
      "Ġfind": 866,
      "par": 867,
      "Ġclosed": 868,
      "Ġexample": 869,
      "Ġneed": 870,
      "ads": 871,
      "Ġ8": 872,
      "=\\": 873,
      "Ġrelations": 874,
      "Ġexists": 875,
      "$,": 876,
      "}$$": 877,
      "Ġman": 878,
      "nected": 879,
      "raph": 880,
      "rt": 881,
      "Ġpressure": 882,
      "Ġcor": 883,
      "alse": 884,
      "ince": 885,
      "Ġcircuit": 886,
      "Ġsw": 887,
      "op": 888,
      "Ġmodel": 889,
      "}^{": 890,
      "Ġ9": 891,
      "Ġev": 892,
      "under": 893,
      "Ġstrong": 894,
      "Ġnode": 895,
      "----": 896,
      "Ġrelationship": 897,
      "rm": 898,
      "Ġshow": 899,
      "resh": 900,
      "Ġground": 901,
      "11": 902,
      "pace": 903,
      "cre": 904,
      "$\\": 905,
      "Ġengine": 906,
      "Ġrunning": 907,
      "itch": 908,
      "Ġdoes": 909,
      "Ġsuch": 910,
      "ng": 911,
      "qrt": 912,
      "ĠIt": 913,
      "led": 914,
      "Ġup": 915,
      "ĠAl": 916,
      "Ġvalid": 917,
      "ap": 918,
      "der": 919,
      "ange": 920,
      "Ġgiven": 921,
      "We": 922,
      "ility": 923,
      "Ġconnected": 924,
      "ween": 925,
      "ulti": 926,
      "Ġfalse": 927,
      "reshold": 928,
      "Ġour": 929,
      "Ġcons": 930,
      "Ġsolution": 931,
      "Ġthreshold": 932,
      "rix": 933,
      "ov": 934,
      "ace": 935,
      "Ġused": 936,
      "Ġve": 937,
      "Ġswitch": 938,
      "ions": 939,
      "ays": 940,
      "Ġsame": 941,
      "ating": 942,
      "dot": 943,
      "Ġunder": 944,
      "Ġbetween": 945,
      "hemat": 946,
      "Ġits": 947,
      "Ġlock": 948,
      "Ġz": 949,
      "Ġequation": 950,
      "Ġresult": 951,
      "row": 952,
      "####": 953,
      "lipp": 954,
      "Ġholds": 955,
      "ĠRe": 956,
      "Ġtrans": 957,
      "ty": 958,
      "sqrt": 959,
      "iew": 960,
      "Ġ,": 961,
      "ru": 962,
      "Ġwet": 963,
      "Ġ20": 964,
      "Ġstable": 965,
      "Ġ|": 966,
      "Ġslipp": 967,
      "Ġdoor": 968,
      "Ġconverges": 969,
      "ties": 970,
      "ues": 971,
      "Ġslippery": 972,
      "aged": 973,
      "Ġleads": 974,
      "Ġbas": 975,
      "not": 976,
      "ane": 977,
      "ĠPro": 978,
      "lic": 979,
      "oc": 980,
      "ield": 981,
      "empty": 982,
      "Ġraining": 983,
      "Ġcol": 984,
      "ĠSt": 985,
      "Ġansw": 986,
      "Ġcur": 987,
      "Ġactive": 988,
      "Ġinto": 989,
      "ks": 990,
      "Ġpa": 991,
      "eta": 992,
      "Ġover": 993,
      "ethod": 994,
      "Ġfollowing": 995,
      "Ġdes": 996,
      "yn": 997,
      "ts": 998,
      "Ġ<": 999,
      "port": 1000,
      "its": 1001,
      "ible": 1002,
      "Ġengaged": 1003,
      "Ġthese": 1004,
      "Ġshould": 1005,
      "ib": 1006,
      "Ġjust": 1007,
      "Ġthey": 1008,
      "Ġcomm": 1009,
      "ual": 1010,
      "Ġ200": 1011,
      "ize": 1012,
      "line": 1013,
      "resent": 1014,
      "ting": 1015,
      "Ġnew": 1016,
      "times": 1017,
      "19": 1018,
      "ĠFor": 1019,
      "pi": 1020,
      "bers": 1021,
      "Ġty": 1022,
      "ĠHow": 1023,
      "ron": 1024,
      "Ġcalcul": 1025,
      "ec": 1026,
      "ia": 1027,
      "ise": 1028,
      "ments": 1029,
      "ctor": 1030,
      "Ġexp": 1031,
      "ian": 1032,
      "ific": 1033,
      "//": 1034,
      "Ġterm": 1035,
      "olog": 1036,
      "15": 1037,
      "play": 1038,
      "Ġprodu": 1039,
      "ument": 1040,
      "pr": 1041,
      "Ġsee": 1042,
      "This": 1043,
      "Ġclass": 1044,
      "Ġ12": 1045,
      "Ġph": 1046,
      "ĠCon": 1047,
      "very": 1048,
      "ix": 1049,
      "pend": 1050,
      "val": 1051,
      "Ġwant": 1052,
      "yle": 1053,
      "ÂłÂł": 1054,
      "ral": 1055,
      "vers": 1056,
      "13": 1057,
      "Ġmulti": 1058,
      "gy": 1059,
      "}{\\": 1060,
      "Ġway": 1061,
      "angle": 1062,
      "mathbb": 1063,
      "},": 1064,
      "Ġbeing": 1065,
      "Ġmethod": 1066,
      "Ġanswer": 1067,
      "To": 1068,
      "Ġsc": 1069,
      "Ġfact": 1070,
      "rent": 1071,
      "Ġfile": 1072,
      "Ġappro": 1073,
      "ĠEx": 1074,
      "bra": 1075,
      "ug": 1076,
      "cause": 1077,
      "Ġfe": 1078,
      "Ġprove": 1079,
      "pro": 1080,
      "ser": 1081,
      "enti": 1082,
      "Ġdifferent": 1083,
      "Ġreg": 1084,
      "Ġâ": 1085,
      "Ġ19": 1086,
      "Ġstat": 1087,
      "ough": 1088,
      "cond": 1089,
      "bab": 1090,
      "ater": 1091,
      "ithm": 1092,
      "Ġag": 1093,
      "Ġcase": 1094,
      "ced": 1095,
      "len": 1096,
      "16": 1097,
      "ĠCh": 1098,
      "ower": 1099,
      "xim": 1100,
      "rou": 1101,
      "urn": 1102,
      "lis": 1103,
      "egin": 1104,
      "Ġpr": 1105,
      "ook": 1106,
      "14": 1107,
      ")=": 1108,
      "Ġinst": 1109,
      ")\\": 1110,
      "Ġchar": 1111,
      "cdot": 1112,
      "ffic": 1113,
      "amet": 1114,
      "Ġthem": 1115,
      "Ġstud": 1116,
      "Ġhel": 1117,
      "ĠCom": 1118,
      "ings": 1119,
      "Ġmust": 1120,
      "dis": 1121,
      "tt": 1122,
      "vel": 1123,
      "Ġadd": 1124,
      "Ġhere": 1125,
      "Ġmay": 1126,
      "begin": 1127,
      "ex": 1128,
      "Ġlook": 1129,
      "ĠFrom": 1130,
      "gor": 1131,
      "'m": 1132,
      "ously": 1133,
      "ĠUn": 1134,
      "Ġdon": 1135,
      "asure": 1136,
      "hed": 1137,
      "Ġrep": 1138,
      "tical": 1139,
      "ym": 1140,
      "ole": 1141,
      "ract": 1142,
      "gebra": 1143,
      "Ġprov": 1144,
      "ĠMat": 1145,
      "Ġpol": 1146,
      "Ġnumbers": 1147,
      "ational": 1148,
      "Ġspace": 1149,
      "cent": 1150,
      "ake": 1151,
      "style": 1152,
      "201": 1153,
      "ick": 1154,
      "Ġsm": 1155,
      "Ġcomput": 1156,
      "set": 1157,
      "inal": 1158,
      "))": 1159,
      "17": 1160,
      "ount": 1161,
      "18": 1162,
      "Ġser": 1163,
      "ark": 1164,
      "Ġthink": 1165,
      "ctions": 1166,
      "vi": 1167,
      "mathrm": 1168,
      "Ġassume": 1169,
      "Ġmin": 1170,
      "plies": 1171,
      "Ġtheir": 1172,
      "ribution": 1173,
      "Ġfield": 1174,
      "Ġbeen": 1175,
      "Rule": 1176,
      "ten": 1177,
      "Ġpartic": 1178,
      "ient": 1179,
      "omet": 1180,
      "Given": 1181,
      "ice": 1182,
      "}_{": 1183,
      "Ġright": 1184,
      "ever": 1185,
      "Ġcomp": 1186,
      "ray": 1187,
      "Ġes": 1188,
      "plic": 1189,
      "Ġfollows": 1190,
      "ĠWhat": 1191,
      "ĠÂł": 1192,
      "ote": 1193,
      "Ġcould": 1194,
      "ergy": 1195,
      "Ġmany": 1196,
      "Ġbecause": 1197,
      "uch": 1198,
      "Ġstatem": 1199,
      "pect": 1200,
      "Ġ>": 1201,
      "Ġhelp": 1202,
      "Ġdet": 1203,
      "ox": 1204,
      "Ġmean": 1205,
      "Ġmake": 1206,
      "ell": 1207,
      "Ġed": 1208,
      "Ġ...": 1209,
      "ĠQu": 1210,
      "sin": 1211,
      "Ġposs": 1212,
      "upp": 1213,
      "lect": 1214,
      "display": 1215,
      "000": 1216,
      "ĠSo": 1217,
      "fter": 1218,
      "ngth": 1219,
      "sc": 1220,
      "25": 1221,
      "Ġelect": 1222,
      "Ġ*": 1223,
      "formation": 1224,
      "cy": 1225,
      "âĢĿ": 1226,
      "work": 1227,
      "Ġcode": 1228,
      "cept": 1229,
      "Ġ/": 1230,
      "Ġorder": 1231,
      "Ġtop": 1232,
      "Ġsp": 1233,
      "Ġanal": 1234,
      "Ġ15": 1235,
      "Ġprobab": 1236,
      "Ġmeasure": 1237,
      "Ġoper": 1238,
      "Ġformul": 1239,
      "Ġvalues": 1240,
      "ages": 1241,
      "Ġevery": 1242,
      "Ġsecond": 1243,
      "Ġmod": 1244,
      "Ġspec": 1245,
      "Ġproper": 1246,
      "ension": 1247,
      ",\\": 1248,
      "Ġext": 1249,
      "pha": 1250,
      "AT": 1251,
      "Ġ\\\\": 1252,
      "Ġsum": 1253,
      "displaystyle": 1254,
      "log": 1255,
      "tern": 1256,
      ")$$": 1257,
      "Ġgraph": 1258,
      "cos": 1259,
      "Ġcannot": 1260,
      "ider": 1261,
      "ĠYou": 1262,
      "iss": 1263,
      "uth": 1264,
      "ually": 1265,
      "stand": 1266,
      "Ġpost": 1267,
      "io": 1268,
      "tit": 1269,
      "-\\": 1270,
      "ude": 1271,
      "Ġmatrix": 1272,
      "cur": 1273,
      "Ġreal": 1274,
      "____": 1275,
      "olution": 1276,
      ")^": 1277,
      "ail": 1278,
      ")(": 1279,
      "Ġinv": 1280,
      "ero": 1281,
      "Ġfunctions": 1282,
      "err": 1283,
      "Ġvery": 1284,
      "Ġsur": 1285,
      "Ġint": 1286,
      "sum": 1287,
      "ute": 1288,
      "Ġtest": 1289,
      "arrow": 1290,
      "Ġ}": 1291,
      "ĠâĢľ": 1292,
      "arg": 1293,
      "Ġstart": 1294,
      ");": 1295,
      "orem": 1296,
      "22": 1297,
      "rough": 1298,
      "Ġmost": 1299,
      "app": 1300,
      "own": 1301,
      "Ġgeneral": 1302,
      "theta": 1303,
      "Ġequal": 1304,
      "ines": 1305,
      "}(": 1306,
      "ull": 1307,
      "Ġem": 1308,
      "ved": 1309,
      "ĠThen": 1310,
      "ĠAlso": 1311,
      "Ġincl": 1312,
      "==": 1313,
      "for": 1314,
      "Ġenergy": 1315,
      "ons": 1316,
      "ful": 1317,
      "ying": 1318,
      "da": 1319,
      "andom": 1320,
      "Ġ11": 1321,
      "amb": 1322,
      "Ġ14": 1323,
      "Ġyear": 1324,
      "://": 1325,
      "Ġ16": 1326,
      "Ġpoints": 1327,
      "over": 1328,
      "cture": 1329,
      "fty": 1330,
      "30": 1331,
      "gorithm": 1332,
      "infty": 1333,
      "qui": 1334,
      "uppose": 1335,
      "ĠAnd": 1336,
      "ultane": 1337,
      "gram": 1338,
      "Ġequations": 1339,
      "ob": 1340,
      "Ġang": 1341,
      "alpha": 1342,
      "ression": 1343,
      "Ġsimultane": 1344,
      "Ġsqu": 1345,
      "ey": 1346,
      "Ġgroup": 1347,
      "ĠBoth": 1348,
      "uss": 1349,
      "An": 1350,
      "Ġbound": 1351,
      "ization": 1352,
      "Ġfin": 1353,
      "ither": 1354,
      "Ġ18": 1355,
      "Ġcorrect": 1356,
      "Ġsupp": 1357,
      "inu": 1358,
      "+\\": 1359,
      "ank": 1360,
      "Ġimplies": 1361,
      "Ġnow": 1362,
      "Ġ13": 1363,
      "Ġder": 1364,
      "$$\\": 1365,
      "Ġlim": 1366,
      "arge": 1367,
      "ource": 1368,
      "Ġwell": 1369,
      "ases": 1370,
      "ized": 1371,
      "Ġthrough": 1372,
      "Ġsimultaneously": 1373,
      "ically": 1374,
      "Ġexpl": 1375,
      "ax": 1376,
      "arch": 1377,
      "Ġwrong": 1378,
      "Ġcre": 1379,
      "Ġobject": 1380,
      "Ġvector": 1381,
      "ormal": 1382,
      "Ġdistribution": 1383,
      "Ġtra": 1384,
      "ology": 1385,
      "hes": 1386,
      "ides": 1387,
      "Ġpossible": 1388,
      "Ġver": 1389,
      "Ġdesc": 1390,
      "col": 1391,
      "ism": 1392,
      "Ġind": 1393,
      "Ġinde": 1394,
      "ted": 1395,
      "Ġhy": 1396,
      "Ġ#": 1397,
      "ots": 1398,
      "lf": 1399,
      "quen": 1400,
      "igure": 1401,
      "ĠSince": 1402,
      ".,": 1403,
      "Ġlist": 1404,
      "ctive": 1405,
      "ik": 1406,
      "ding": 1407,
      "Ġlog": 1408,
      "ĠSe": 1409,
      "Ġide": 1410,
      "Ġunderstand": 1411,
      "oint": 1412,
      "Ġparamet": 1413,
      "aw": 1414,
      "Ġeven": 1415,
      "Ġbased": 1416,
      "Ġlinear": 1417,
      "omial": 1418,
      "Ġwere": 1419,
      "Ġpaper": 1420,
      "Ġlet": 1421,
      "^{-": 1422,
      "Ġconstant": 1423,
      "eb": 1424,
      "ticle": 1425,
      "}^": 1426,
      "tal": 1427,
      "Ġerr": 1428,
      "ĠĠĠĠĠĠĠĠ": 1429,
      "Ġtheory": 1430,
      "Ġ@": 1431,
      "Ġvol": 1432,
      "rest": 1433,
      "round": 1434,
      "Ġtype": 1435,
      "Ġpart": 1436,
      "ined": 1437,
      "hematics": 1438,
      "Ġlength": 1439,
      "ambda": 1440,
      "Ġrad": 1441,
      "21": 1442,
      "Ġthree": 1443,
      "Ġdec": 1444,
      "Ġcurrent": 1445,
      "ivers": 1446,
      "Ġbelow": 1447,
      "Ġread": 1448,
      "ference": 1449,
      "andard": 1450,
      "ysis": 1451,
      "ÃĹ": 1452,
      "50": 1453,
      "For": 1454,
      "Ġdef": 1455,
      "ives": 1456,
      "Ġid": 1457,
      "Ġrepresent": 1458,
      "ply": 1459,
      "ere": 1460,
      "ume": 1461,
      "ential": 1462,
      "Ġsimple": 1463,
      "Ġdiv": 1464,
      "ĠNe": 1465,
      "Ġmass": 1466,
      "--------": 1467,
      "Ġdisc": 1468,
      "Ġformula": 1469,
      "Ġalgorithm": 1470,
      "other": 1471,
      "lim": 1472,
      "Suppose": 1473,
      "ĠSh": 1474,
      "Ġend": 1475,
      "Ġsing": 1476,
      "ĠMath": 1477,
      "Ġsym": 1478,
      "Ġact": 1479,
      "imension": 1480,
      "):": 1481,
      "mat": 1482,
      "mathcal": 1483,
      "\",": 1484,
      "Ġcomplex": 1485,
      "Ġcontain": 1486,
      "ier": 1487,
      "face": 1488,
      "Ġmuch": 1489,
      "Ġstru": 1490,
      "read": 1491,
      "Ġsince": 1492,
      "als": 1493,
      "Ġca": 1494,
      "Ġestim": 1495,
      "Ġrequi": 1496,
      "Ġsay": 1497,
      "Ġresults": 1498,
      "Ġeas": 1499,
      "igma": 1500,
      "Ġproduct": 1501,
      "Ġ17": 1502,
      "ĠPh": 1503,
      "Let": 1504,
      "ann": 1505,
      "ĠDe": 1506,
      "Ġmet": 1507,
      "ffect": 1508,
      "view": 1509,
      "rodu": 1510,
      "fer": 1511,
      "ho": 1512,
      "Ġlong": 1513,
      "Ġdeterm": 1514,
      "lease": 1515,
      "Ġfound": 1516,
      "Ġchange": 1517,
      "mathbf": 1518,
      "Ġfl": 1519,
      "ves": 1520,
      "Ġimport": 1521,
      "Ġconf": 1522,
      "quence": 1523,
      "Ġtim": 1524,
      "Ġcalled": 1525,
      "Ġrandom": 1526,
      "],": 1527,
      "23": 1528,
      "Ġexper": 1529,
      "chn": 1530,
      "Ġsmall": 1531,
      "Ġtext": 1532,
      "Ġterms": 1533,
      "ĠÂ": 1534,
      "ited": 1535,
      "Ġrat": 1536,
      "Ġtake": 1537,
      "Ġafter": 1538,
      "heck": 1539,
      "Ġopp": 1540,
      "Ġinput": 1541,
      "ilar": 1542,
      "99": 1543,
      "24": 1544,
      "Ġcent": 1545,
      "Ġderiv": 1546,
      "fic": 1547,
      "ometh": 1548,
      "tice": 1549,
      "mu": 1550,
      "ily": 1551,
      "Ġinformation": 1552,
      "Ex": 1553,
      "ward": 1554,
      "omething": 1555,
      "bl": 1556,
      "Re": 1557,
      "ĠTe": 1558,
      "stract": 1559,
      "Ġzero": 1560,
      "ĠIs": 1561,
      "Ġquestions": 1562,
      "ysics": 1563,
      "ĠTo": 1564,
      "be": 1565,
      "pos": 1566,
      "alen": 1567,
      "turn": 1568,
      "Ġbu": 1569,
      "Ġmeans": 1570,
      "Ġsolve": 1571,
      "\\\\": 1572,
      "Ġalgebra": 1573,
      "eps": 1574,
      "Ġvers": 1575,
      "Ġcharact": 1576,
      "#####": 1577,
      "Ġlevel": 1578,
      "py": 1579,
      "ton": 1580,
      "bit": 1581,
      "Ġ{\\": 1582,
      "Ġseries": 1583,
      "iqu": 1584,
      "Ġlear": 1585,
      "}=": 1586,
      "ins": 1587,
      "ven": 1588,
      "Ġseem": 1589,
      "ĠThese": 1590,
      "ict": 1591,
      "âĢĵ": 1592,
      "ern": 1593,
      "Ġincre": 1594,
      "phi": 1595,
      "orph": 1596,
      "ving": 1597,
      "ural": 1598,
      "ased": 1599,
      "Ġvariables": 1600,
      "$-": 1601,
      "Ġgre": 1602,
      "Ġtak": 1603,
      "Ġtri": 1604,
      "Ġprogram": 1605,
      "Ġ$(": 1606,
      "Ġback": 1607,
      "Ġprobability": 1608,
      "Ġstructure": 1609,
      "lear": 1610,
      "ember": 1611,
      "sh": 1612,
      "fficient": 1613,
      "Ġinterest": 1614,
      "ets": 1615,
      "lock": 1616,
      "Ġoutput": 1617,
      "bol": 1618,
      "eomet": 1619,
      "istic": 1620,
      "}$.": 1621,
      "osite": 1622,
      "raw": 1623,
      "verse": 1624,
      "equ": 1625,
      "Ġdid": 1626,
      "Ġacc": 1627,
      "cial": 1628,
      "anks": 1629,
      "Ġarea": 1630,
      "ration": 1631,
      "Ġintegral": 1632,
      "ross": 1633,
      "Ġperform": 1634,
      "Ġview": 1635,
      "Ġstate": 1636,
      "lambda": 1637,
      "Ġden": 1638,
      "Ġsomething": 1639,
      "Ġtyp": 1640,
      "Ġpower": 1641,
      "âĪ": 1642,
      "200": 1643,
      "Ġproblems": 1644,
      "met": 1645,
      "ĠQuestion": 1646,
      "Ġent": 1647,
      "Ġsample": 1648,
      "Ġsti": 1649,
      "Ġdirect": 1650,
      "34": 1651,
      "Ġstandard": 1652,
      "Ġallow": 1653,
      "king": 1654,
      "clus": 1655,
      "Ġobser": 1656,
      "ynomial": 1657,
      "partial": 1658,
      "Ġav": 1659,
      "Ġerror": 1660,
      "Ġq": 1661,
      "nal": 1662,
      "Ġet": 1663,
      "So": 1664,
      "You": 1665,
      "ĠAr": 1666,
      "Ġgood": 1667,
      "atic": 1668,
      "Ġtheorem": 1669,
      "Ġstatement": 1670,
      "velo": 1671,
      "Ġsize": 1672,
      "Ġorig": 1673,
      "Ġdepend": 1674,
      "()": 1675,
      "beta": 1676,
      "It": 1677,
      "ocument": 1678,
      "Ġdown": 1679,
      "Ġconsider": 1680,
      "Ġwhy": 1681,
      "Ġsquare": 1682,
      "ĠLet": 1683,
      "ild": 1684,
      "ĠAs": 1685,
      "Ġ)": 1686,
      "^{\\": 1687,
      "Te": 1688,
      "Ġpe": 1689,
      "ript": 1690,
      "org": 1691,
      "27": 1692,
      "ords": 1693,
      "ĠWh": 1694,
      "Ġmon": 1695,
      "ision": 1696,
      "Ġwithout": 1697,
      "Ġmag": 1698,
      "Ġsingle": 1699,
      "bin": 1700,
      "33": 1701,
      "ĠCl": 1702,
      "Ġwrit": 1703,
      "Ġ25": 1704,
      "Ġ30": 1705,
      "40": 1706,
      "Ġdescrib": 1707,
      "St": 1708,
      "ordin": 1709,
      "Ġopposite": 1710,
      "Ġdeg": 1711,
      "Ġoff": 1712,
      "Ġfinite": 1713,
      "Ġdefinition": 1714,
      "ality": 1715,
      "ER": 1716,
      "Ġdistance": 1717,
      "28": 1718,
      "Ġfre": 1719,
      "uthor": 1720,
      "ify": 1721,
      "Ġgu": 1722,
      "_{\\": 1723,
      "rol": 1724,
      "Qu": 1725,
      "100": 1726,
      "ators": 1727,
      "ided": 1728,
      "ublic": 1729,
      "Pro": 1730,
      "Ġidenti": 1731,
      "rightarrow": 1732,
      "Ġthough": 1733,
      "Ġpresent": 1734,
      "Ġgive": 1735,
      "Ġsure": 1736,
      "$$.": 1737,
      "raction": 1738,
      "alle": 1739,
      "Ġfactor": 1740,
      "where": 1741,
      "dx": 1742,
      "dfrac": 1743,
      "....": 1744,
      "ities": 1745,
      "ĠOn": 1746,
      "Ġpack": 1747,
      "ĠâĪ": 1748,
      "array": 1749,
      "tiv": 1750,
      "ulation": 1751,
      "Ġrate": 1752,
      "Ġsequence": 1753,
      "respon": 1754,
      "Ġrem": 1755,
      "Ġhad": 1756,
      "Ġwrite": 1757,
      "amma": 1758,
      "Ġelement": 1759,
      "get": 1760,
      "Ġ23": 1761,
      "ĠMay": 1762,
      "26": 1763,
      "}}{": 1764,
      "cc": 1765,
      "Ġcontinu": 1766,
      "Ġlarge": 1767,
      "Ġtotal": 1768,
      "ĠÎ": 1769,
      "ways": 1770,
      "ĠNo": 1771,
      "Ġapplic": 1772,
      "Ġthose": 1773,
      "ynam": 1774,
      "Con": 1775,
      "city": 1776,
      "'ve": 1777,
      "ead": 1778,
      "Ġexact": 1779,
      "str": 1780,
      "rel": 1781,
      "hematical": 1782,
      "ilon": 1783,
      "Ġparticular": 1784,
      "Ġoption": 1785,
      "br": 1786,
      "05": 1787,
      "self": 1788,
      "Ġradi": 1789,
      "ified": 1790,
      "Ġbook": 1791,
      "apter": 1792,
      "iversity": 1793,
      "Ġminim": 1794,
      "Ġanother": 1795,
      "Ġprop": 1796,
      "oid": 1797,
      "Ġ?": 1798,
      "Ġdoc": 1799,
      "Ġobtain": 1800,
      "cel": 1801,
      "Ġlimit": 1802,
      "Ġmight": 1803,
      "**": 1804,
      "ason": 1805,
      "Ġtimes": 1806,
      "uring": 1807,
      "tex": 1808,
      "stit": 1809,
      "etwork": 1810,
      "Ġcar": 1811,
      "{{": 1812,
      "ish": 1813,
      "Ġpolynomial": 1814,
      "gg": 1815,
      "Ġcharacter": 1816,
      "What": 1817,
      "Ġless": 1818,
      "How": 1819,
      "Ġnormal": 1820,
      "Ġknown": 1821,
      "bstract": 1822,
      "Ġhand": 1823,
      "ttp": 1824,
      "Ġstill": 1825,
      "sub": 1826,
      "matrix": 1827,
      "ond": 1828,
      "tics": 1829,
      "Ġreally": 1830,
      "leq": 1831,
      "til": 1832,
      "Ġside": 1833,
      "60": 1834,
      "Ġ100": 1835,
      "Ġinfin": 1836,
      "ixed": 1837,
      "Ġmaxim": 1838,
      "Ġsolutions": 1839,
      "ĠOr": 1840,
      "ivalen": 1841,
      "rection": 1842,
      "comm": 1843,
      "ene": 1844,
      "uc": 1845,
      "action": 1846,
      "Ġname": 1847,
      "Ġanalysis": 1848,
      "ĠJan": 1849,
      "Ġyears": 1850,
      "ĠPost": 1851,
      "ĠHowever": 1852,
      "Ġrec": 1853,
      "}}$": 1854,
      "Ġwhile": 1855,
      "Ġconstru": 1856,
      "Ġmath": 1857,
      "Ġarg": 1858,
      "Ġinclud": 1859,
      "angu": 1860,
      "Ġleft": 1861,
      "Ġ21": 1862,
      "Ġconclus": 1863,
      "Ġax": 1864,
      "Ġpage": 1865,
      "29": 1866,
      "ww": 1867,
      "Ġ24": 1868,
      "ensity": 1869,
      "pre": 1870,
      "Ġforce": 1871,
      "Ġbefore": 1872,
      "umn": 1873,
      "ublis": 1874,
      "sigma": 1875,
      "Ġleast": 1876,
      "})": 1877,
      "Ġcheck": 1878,
      "ĠMar": 1879,
      "iod": 1880,
      "gative": 1881,
      "align": 1882,
      "Ġcho": 1883,
      "Ġ22": 1884,
      "Ġelectron": 1885,
      "Ġmo": 1886,
      "ense": 1887,
      "Ġsimilar": 1888,
      "35": 1889,
      "Ġchang": 1890,
      "Ġins": 1891,
      "Ġreturn": 1892,
      "ner": 1893,
      "ĠJun": 1894,
      "Ġrule": 1895,
      "Ġatt": 1896,
      "$$,": 1897,
      "df": 1898,
      "Ġelements": 1899,
      "Ġcompa": 1900,
      "ST": 1901,
      "Ġunit": 1902,
      "Ġversion": 1903,
      "45": 1904,
      "sing": 1905,
      "anti": 1906,
      "Ġapproxim": 1907,
      "Ġangle": 1908,
      "Ġtechn": 1909,
      "Ġcorrespon": 1910,
      "Ġalways": 1911,
      "Ġeffect": 1912,
      "omorph": 1913,
      "velop": 1914,
      "ople": 1915,
      "Ġspecific": 1916,
      "Ġlit": 1917,
      "Ġcommon": 1918,
      "Ġtable": 1919,
      "antum": 1920,
      "Ġbl": 1921,
      "ailable": 1922,
      "mer": 1923,
      "ault": 1924,
      "Ġini": 1925,
      "ertain": 1926,
      "rame": 1927,
      "ĠOct": 1928,
      "Ġfigure": 1929,
      "alcul": 1930,
      "ON": 1931,
      "dd": 1932,
      "Ġeither": 1933,
      "document": 1934,
      "plement": 1935,
      "cience": 1936,
      "ĠFeb": 1937,
      "ness": 1938,
      "Ġwave": 1939,
      "wh": 1940,
      "Ġdiag": 1941,
      "Ġlast": 1942,
      "ĠĠĠ": 1943,
      "pack": 1944,
      "min": 1945,
      "Ġpred": 1946,
      "roup": 1947,
      "ately": 1948,
      "Ġsa": 1949,
      "Ġconsist": 1950,
      "vec": 1951,
      "âĢ¦": 1952,
      "ĠApp": 1953,
      "Ã©": 1954,
      "aving": 1955,
      "Ġwhe": 1956,
      "ĠÂłĠÂł": 1957,
      "come": 1958,
      "There": 1959,
      "``": 1960,
      "Ġsurface": 1961,
      "inary": 1962,
      "ga": 1963,
      "Ġago": 1964,
      "ĠLa": 1965,
      "Ġfree": 1966,
      "ription": 1967,
      "Ġinteger": 1968,
      "less": 1969,
      "Ġredu": 1970,
      "chan": 1971,
      "36": 1972,
      "Ġcoe": 1973,
      "space": 1974,
      "abel": 1975,
      "Ġpair": 1976,
      "rans": 1977,
      ".)": 1978,
      "Ġconclusions": 1979,
      "Ġdoesn": 1980,
      "AR": 1981,
      "paces": 1982,
      "32": 1983,
      "Ġconstraints": 1984,
      "}$,": 1985,
      "vious": 1986,
      "ior": 1987,
      "Ġ${\\": 1988,
      "ium": 1989,
      "Ġaround": 1990,
      "Ġwor": 1991,
      "Ġbeh": 1992,
      "Ġstudy": 1993,
      "Ġcoordin": 1994,
      "ctors": 1995,
      "Ġlink": 1996,
      "au": 1997,
      "Ġcommand": 1998,
      "onal": 1999,
      "Ġproperties": 2000,
      "}_": 2001,
      "box": 2002,
      "0000": 2003,
      "Ġdiscuss": 2004,
      "ody": 2005,
      "Ġapproach": 2006,
      "Ġstatements": 2007,
      "Ġequivalen": 2008,
      "Ġcalculate": 2009,
      "ÂłÂłÂłÂł": 2010,
      "ĠUniversity": 2011,
      "IN": 2012,
      "Ġkey": 2013,
      "ourse": 2014,
      "39": 2015,
      "ability": 2016,
      "ĠLe": 2017,
      "kes": 2018,
      "Ġcy": 2019,
      "Ġlow": 2020,
      "ournal": 2021,
      "Ġexpect": 2022,
      "Ġimage": 2023,
      "Ġpot": 2024,
      "quad": 2025,
      "ash": 2026,
      "Ġsystems": 2027,
      ")$.": 2028,
      "Ġnumer": 2029,
      "Ġsupport": 2030,
      "ĠDec": 2031,
      "man": 2032,
      "umber": 2033,
      "Ġaut": 2034,
      "(-": 2035,
      "Ġgeomet": 2036,
      "ï¿": 2037,
      "ique": 2038,
      "pendent": 2039,
      "name": 2040,
      "ĠEn": 2041,
      "Ġmodels": 2042,
      "Ġaddition": 2043,
      "ĠFind": 2044,
      "color": 2045,
      "Ġdifference": 2046,
      "TeX": 2047,
      "Ġtoo": 2048,
      "cho": 2049,
      "ï¿½": 2050,
      "rid": 2051,
      "Ġgives": 2052,
      "Ġcompon": 2053,
      "Ġdom": 2054,
      "Ġoptim": 2055,
      "}+": 2056,
      "verage": 2057,
      "Ġpeople": 2058,
      "Ġimportant": 2059,
      "jec": 2060,
      "Ġmain": 2061,
      "Ġexpression": 2062,
      "imensional": 2063,
      "ĠNew": 2064,
      "ĠAug": 2065,
      "ĠSep": 2066,
      "tle": 2067,
      "Ġhis": 2068,
      "Ġtrying": 2069,
      "oment": 2070,
      "Ġdevelop": 2071,
      "Ġlines": 2072,
      "Ġworks": 2073,
      "Ġposition": 2074,
      "SE": 2075,
      "gen": 2076,
      "elta": 2077,
      "Ġgra": 2078,
      "del": 2079,
      "oh": 2080,
      "Ġdone": 2081,
      "Ġbit": 2082,
      "yth": 2083,
      "Ġpass": 2084,
      "Ġvelo": 2085,
      "Ġagain": 2086,
      "Ġatom": 2087,
      "Ġstep": 2088,
      "bar": 2089,
      "Ġfew": 2090,
      "Ġfrequen": 2091,
      "ames": 2092,
      "MAT": 2093,
      "ateg": 2094,
      "Ġwater": 2095,
      "Ġmade": 2096,
      "ups": 2097,
      "by": 2098,
      "circ": 2099,
      "Ġcall": 2100,
      "37": 2101,
      "Ġexperim": 2102,
      "Ġbetter": 2103,
      "Ġdocument": 2104,
      "Ġreason": 2105,
      "Ġshe": 2106,
      "AL": 2107,
      "Ġavailable": 2108,
      "ouble": 2109,
      "me": 2110,
      "Ġcertain": 2111,
      "07": 2112,
      "Ġref": 2113,
      "As": 2114,
      "'re": 2115,
      "Now": 2116,
      "Ġgot": 2117,
      "omega": 2118,
      "Ġel": 2119,
      "wise": 2120,
      "Ġcontrol": 2121,
      "Ġspeed": 2122,
      "Ġtry": 2123,
      "08": 2124,
      "Ġpat": 2125,
      "Ġdesign": 2126,
      "ha": 2127,
      "mon": 2128,
      "package": 2129,
      "Ġperiod": 2130,
      "Ġwho": 2131,
      "Ġke": 2132,
      "idth": 2133,
      "ware": 2134,
      "ĠBe": 2135,
      "teg": 2136,
      "Ġloc": 2137,
      "place": 2138,
      "Ġ--": 2139,
      "let": 2140,
      "thing": 2141,
      "Ġmultiple": 2142,
      "Ġexplain": 2143,
      "Ġidea": 2144,
      "06": 2145,
      "Ġsets": 2146,
      "ĠMathematics": 2147,
      "ĠWhen": 2148,
      "Ġsource": 2149,
      "cale": 2150,
      "Delta": 2151,
      "ystem": 2152,
      "Ġcontains": 2153,
      "Al": 2154,
      "Ġseems": 2155,
      "Ġmethods": 2156,
      ")/": 2157,
      "}}\\": 2158,
      "class": 2159,
      "day": 2160,
      "Ġrange": 2161,
      "Ġnegative": 2162,
      "Ġ##": 2163,
      "Ġinitial": 2164,
      "ification": 2165,
      "ln": 2166,
      "ars": 2167,
      "Ġ${": 2168,
      "Ġshown": 2169,
      "way": 2170,
      "Ġweight": 2171,
      "38": 2172,
      "oci": 2173,
      "09": 2174,
      "ĠDo": 2175,
      "Ġcircle": 2176,
      "Ġ28": 2177,
      "Ġlangu": 2178,
      "04": 2179,
      "inally": 2180,
      "Ġadv": 2181,
      "Ġcell": 2182,
      "Ġdraw": 2183,
      "Ġwhether": 2184,
      "vir": 2185,
      "Ġ2017": 2186,
      "Ġdirection": 2187,
      "',": 2188,
      "Ġcolumn": 2189,
      "time": 2190,
      "sol": 2191,
      "ttps": 2192,
      "Ġhapp": 2193,
      "Ġexpress": 2194,
      "====": 2195,
      "ffici": 2196,
      "Ġtool": 2197,
      "Ġnetwork": 2198,
      "Ġput": 2199,
      "SS": 2200,
      "Ġsugg": 2201,
      "Ġcost": 2202,
      "Ġflow": 2203,
      "ĠPre": 2204,
      "Ġwithin": 2205,
      "Ġable": 2206,
      "Ġfar": 2207,
      "ĠRes": 2208,
      "Ġlat": 2209,
      "ental": 2210,
      "Ġask": 2211,
      "anation": 2212,
      ">>": 2213,
      "cise": 2214,
      "itle": 2215,
      "^\\": 2216,
      "Ġindic": 2217,
      "Ġhig": 2218,
      "Ġtransform": 2219,
      "rice": 2220,
      "Ġcourse": 2221,
      "}=\\": 2222,
      "Ġvelocity": 2223,
      "ĠThat": 2224,
      "co": 2225,
      "Ġvis": 2226,
      "Ġintrodu": 2227,
      "DF": 2228,
      "Ġbest": 2229,
      "Ġgoing": 2230,
      "ĠMe": 2231,
      "icts": 2232,
      "Ġimplement": 2233,
      "Ġpackage": 2234,
      "Ġ->": 2235,
      "Ġ27": 2236,
      "ering": 2237,
      "]{": 2238,
      "wn": 2239,
      "Ġcos": 2240,
      "Ġtriangle": 2241,
      "55": 2242,
      "Ġoriginal": 2243,
      "OR": 2244,
      "::": 2245,
      "Ġfour": 2246,
      "usepackage": 2247,
      "Com": 2248,
      "earch": 2249,
      "igen": 2250,
      "itor": 2251,
      "indow": 2252,
      "Ġ2018": 2253,
      "Ġmoment": 2254,
      "Ġear": 2255,
      "Ġspect": 2256,
      "Ġiss": 2257,
      "ds": 2258,
      "ĠNov": 2259,
      "Ġcreate": 2260,
      "Ġdig": 2261,
      "Ġ26": 2262,
      "ĠCont": 2263,
      "Ġdeta": 2264,
      "Ġthings": 2265,
      "pm": 2266,
      "48": 2267,
      "pri": 2268,
      "DE": 2269,
      "Ġplay": 2270,
      "Ġsepar": 2271,
      "Ġsit": 2272,
      "Ġexpon": 2273,
      "Ġdifferential": 2274,
      "Ġrot": 2275,
      "Ġbase": 2276,
      "odes": 2277,
      "lection": 2278,
      "ĠJul": 2279,
      "Ġmov": 2280,
      "lish": 2281,
      "________": 2282,
      "ready": 2283,
      "erial": 2284,
      "Ġfil": 2285,
      "Ġfiles": 2286,
      "Ġdue": 2287,
      "Ġrelated": 2288,
      "atural": 2289,
      "fo": 2290,
      "netic": 2291,
      "Ġmap": 2292,
      "Ġfeature": 2293,
      "ils": 2294,
      "ĠCalcul": 2295,
      "Ġinterval": 2296,
      "Ġparameters": 2297,
      "Post": 2298,
      "Ġproject": 2299,
      "nown": 2300,
      "ĠEqu": 2301,
      "ribut": 2302,
      "Ġhard": 2303,
      "Ġquanti": 2304,
      "urther": 2305,
      "ah": 2306,
      "02": 2307,
      "rices": 2308,
      "ĠCan": 2309,
      "Ġpers": 2310,
      "Ġdensity": 2311,
      "Ġnext": 2312,
      "Ġpotential": 2313,
      "Ġpop": 2314,
      "ĠHe": 2315,
      "epsilon": 2316,
      "47": 2317,
      "Ġspaces": 2318,
      "viron": 2319,
      "pen": 2320,
      "Ġetc": 2321,
      "ferences": 2322,
      "ype": 2323,
      "ming": 2324,
      "pective": 2325,
      "Ġactually": 2326,
      "AC": 2327,
      "Ġfam": 2328,
      "Ġcontinuous": 2329,
      "ĠSub": 2330,
      "Ġquantum": 2331,
      "Ġwritten": 2332,
      "Ġconditions": 2333,
      "alu": 2334,
      "Ġmark": 2335,
      "ological": 2336,
      "oy": 2337,
      "Se": 2338,
      ")}": 2339,
      "Ġsem": 2340,
      "Ġsever": 2341,
      "Ġappear": 2342,
      "Ġcontradicts": 2343,
      "Ġhaving": 2344,
      "Ġalready": 2345,
      "AB": 2346,
      "Ġsection": 2347,
      "plit": 2348,
      "Ġparameter": 2349,
      "big": 2350,
      "Ġvolume": 2351,
      "ĠProblem": 2352,
      "Ġinstead": 2353,
      "ement": 2354,
      "Ġworking": 2355,
      "linear": 2356,
      "Ġshort": 2357,
      "ĠApr": 2358,
      "Ġarticle": 2359,
      "Ġenc": 2360,
      "Ġsymmet": 2361,
      "tivity": 2362,
      "'ll": 2363,
      "Ġgroups": 2364,
      "ĠIm": 2365,
      "ĠPl": 2366,
      "crete": 2367,
      "Ġstatis": 2368,
      "Ġoc": 2369,
      "Ġseveral": 2370,
      "Ġratio": 2371,
      "ĠHere": 2372,
      "Ġapply": 2373,
      "\".": 2374,
      "Ġintegers": 2375,
      "Ġ2012": 2376,
      "Ġinfinite": 2377,
      "Is": 2378,
      "Ġmem": 2379,
      "Ġexamples": 2380,
      "cing": 2381,
      "Ġsl": 2382,
      "ire": 2383,
      "ractice": 2384,
      "Ġdat": 2385,
      "Ġclear": 2386,
      "Ġblock": 2387,
      "Ġmole": 2388,
      "lied": 2389,
      "Ġprovide": 2390,
      "delta": 2391,
      "ĠâĢĶ": 2392,
      "Ġlaw": 2393,
      "aces": 2394,
      "Ġexactly": 2395,
      "Ġrow": 2396,
      "Ġlocal": 2397,
      "Ġroot": 2398,
      "Ġmaximum": 2399,
      "mit": 2400,
      "44": 2401,
      "ants": 2402,
      "Ġstates": 2403,
      "def": 2404,
      "ances": 2405,
      "Ġstring": 2406,
      "lose": 2407,
      "ii": 2408,
      "rr": 2409,
      "ĠSolution": 2410,
      "Question": 2411,
      "_\\": 2412,
      "Ġsha": 2413,
      "any": 2414,
      "Ġmakes": 2415,
      "Ġ2016": 2416,
      "Ġfrequency": 2417,
      "Ġdefine": 2418,
      "Ġconcept": 2419,
      "Ġvia": 2420,
      "Ġmode": 2421,
      "edia": 2422,
      "ek": 2423,
      ")+": 2424,
      "AN": 2425,
      "rees": 2426,
      "ĠSim": 2427,
      "pper": 2428,
      "alk": 2429,
      "Ġviews": 2430,
      "jective": 2431,
      "ython": 2432,
      "astic": 2433,
      "Ġlower": 2434,
      "rack": 2435,
      "uments": 2436,
      "Ġoccur": 2437,
      "Ġevalu": 2438,
      "Â¶": 2439,
      "Ġassoci": 2440,
      "ters": 2441,
      "ĠHel": 2442,
      "Ġdem": 2443,
      "Ġplane": 2444,
      "rate": 2445,
      "Ġsuper": 2446,
      "ublished": 2447,
      "ission": 2448,
      "Here": 2449,
      "Ġ29": 2450,
      "Ġrema": 2451,
      "Ġamount": 2452,
      "Ġproperty": 2453,
      "Ġrest": 2454,
      "Ġsides": 2455,
      "Ġtypes": 2456,
      "fl": 2457,
      "Ġbo": 2458,
      "Ġmechan": 2459,
      "Ġhom": 2460,
      "Ġfraction": 2461,
      "Ġfixed": 2462,
      "Ġquad": 2463,
      "Ġderivative": 2464,
      "la": 2465,
      "eq": 2466,
      "Ġinvol": 2467,
      "ategory": 2468,
      "xy": 2469,
      "Ġsymbol": 2470,
      "56": 2471,
      "Ġdomain": 2472,
      "}-": 2473,
      "Ġtried": 2474,
      "Ġlearn": 2475,
      "Ġkind": 2476,
      "Ġalong": 2477,
      "Ġ2013": 2478,
      "Ġindependent": 2479,
      "Sh": 2480,
      "49": 2481,
      "ĠAt": 2482,
      "bs": 2483,
      "ording": 2484,
      "ĠAnal": 2485,
